{
    "text": "Well-being stands as a fundamental aspect of positive psychology, exerting positive impacts not only on individuals' personal and professional spheres but also on the collective dynamics of teams and organizations. Prioritizing the understanding and cultivation of individual well-being is paramount for fostering staff health and ensuring sustained organizational success. However, existing tools for assessing subjective well-being often rely on cumbersome surveys and questionnaires, hampering the ability to provide timely feedback crucial for fostering awareness and effecting behavioral change.To address this gap, this paper presents a novel framework for elucidating the role of non-verbal communication in team dynamics, leveraging video data to discern key predictors of individual well-being within collaborative settings. The framework capitalizes on advancements in video acquisition technologies and state-of-the-art artificial intelligence tools to extract individual, relational, and environmental cues from panoramic video footage. Through statistical analysis of each time series, a dataset comprising 125 features is generated, subsequently linked to the PERMA (Positive Emotion, Engagement, Relationships, Meaning, and Accomplishments) surveys developed within the realm of positive psychology.Each facet of the PERMA model is scrutinized through regression or classification methodologies employing machine learning algorithms. To validate our approach, we conducted a case study involving 80 students collaborating in 20 teams over a week-long period on a team task within a face-to-face setting. The outcomes of this study yielded several hypotheses pinpointing factors that influence individual well-being in teamwork.These promising findings underscore the potential for further exploration, including the integration of diverse media modalities for a comprehensive analysis of individual well-being within team contexts. Such endeavors hold the promise of advancing our understanding of the intricate interplay between communication dynamics and individual well-being in collaborative settings.",
    "label": 1,
    "type": 5,
    "name": "bla-028"
}