{
    "text": "This paper proposes a novel cross-domain information fusion matrix decomposition algorithm to address the challenges of inter-domain information fusion and data sparsity in collaborative filtering algorithms, aiming to enhance the accuracy of personalized recommendations in artificial intelligence recommendation systems. The study commences by gathering Douban movie rating data and social network information. To ensure data integrity, Levenshtein distance detection is utilized to eliminate duplicate scores, while natural language processing technology is employed to extract keywords and topic information from social texts. Furthermore, graph convolutional networks are leveraged to convert user relationships into feature vectors, and a unique thermal coding method is introduced to transform discrete user and movie information into binary matrices. To mitigate overfitting, the Ridge regularization method is introduced to gradually optimize potential feature vectors. Weighted average and feature connection techniques are then utilized to amalgamate features from different domains. Additionally, the paper integrates the item-based collaborative filtering algorithm with merged user characteristics to generate personalized recommendation lists. In the experimental phase, the paper conducts cross-domain information fusion optimization on four mainstream mathematical matrix decomposition algorithms: alternating least squares method, non-negative matrix decomposition, singular value decomposition, and latent factor model (LFM), comparing them with the non-fused approach. The results demonstrate a significant enhancement in score accuracy, with mean absolute error and root mean squared error reduced by 12.8% and 13.2% respectively across the four algorithms. Moreover, with k = 10, the average F1 score reaches 0.97, and the ranking accuracy coverage of the LFM algorithm increases by 54.2%. Overall, the mathematical matrix decomposition algorithm combined with cross-domain information fusion exhibits clear advantages in accuracy, prediction performance, recommendation diversity, and ranking quality, thereby improving the accuracy and diversity of the recommendation system. By effectively tackling collaborative filtering challenges through the integration of diverse techniques, it surpasses traditional models in recommendation accuracy and variety.",
    "label": 1,
    "type": 5,
    "name": "bla-090"
}