{
    "text": "This scoping review systematically examines the landscape of serious video games designed for agricultural learning, aiming to identify trends, gaps, and research directions. Following the PRISMA-ScR guidelines, the review provides valuable insights into the effectiveness and potential of these games in immersive educational environments.A thorough search of nine prominent research databases yielded 19 relevant articles published between January 2000 and July 2022. The review underscores a recent surge in the development of serious video games for agricultural learning, particularly in the mobile platform, with a focus on simulation-based approaches featuring 2-D graphics.The targeted audience for these games primarily comprises students, with an emphasis on topics such as crop production and sustainable agriculture. Despite the prevalence of educational objectives, the incorporation of specific educational theories in the game design remains underexplored.Evaluation protocols predominantly rely on pilot studies, prioritizing user experience and knowledge enhancement. Encouragingly, positive outcomes, including improved user experiences, knowledge acquisition, and attitude and behavior changes, are frequently reported across these studies.While the review acknowledges advancements in leveraging serious video games for agricultural education, it also highlights several areas for further exploration and improvement. These include a deeper understanding of the impact of game elements on user experience and effectiveness, the creation of games tailored to underrepresented players and specific agricultural challenges, and the enhancement of theoretical foundations and learning approaches.Ultimately, the review emphasizes the importance of adopting rigorous research designs to assess the effectiveness of serious video games across different time frames, ensuring their relevance and impact in agricultural education.",
    "label": 1,
    "type": 5,
    "name": "bla-098"
}