{
    "text": "Inverse gas chromatography (IGC) has emerged as a highly sensitive, versatile, and efficient technology for analyzing materials. By utilizing thermochemical methods, IGC offers valuable insights into the physicochemical properties of materials, including dispersive surface free energy, Gibbs surface energy components, and Guttamann Lewis acid-base parameters. This comprehensive review delves into the historical evolution, instrumentation, and wide-ranging applications of IGC. Researchers and practitioners will find detailed information on the selection and description of various models utilized in IGC experiments. The applications of IGC span diverse fields, encompassing polymers, pharmaceuticals, minerals, surfactants, and nanomaterials. Additionally, IGC enables the measurement of critical parameters such as sorption enthalpy and entropy, surface energy components, adhesion work, glass transition temperature, surface heterogeneity, miscibility, solubility parameters, and specific surface area. These insights contribute to a deeper comprehension of material behavior and facilitate the design and optimization of advanced materials. Furthermore, the integration of computer vision and image processing techniques with IGC has enhanced our understanding of material surface characteristics, texture, and related properties. The convergence of IGC with computer vision and artificial intelligence (AI) offers promising prospects for exploring chemical materials, opening new avenues for research and discovery. This paper not only offers a comprehensive overview of IGC, its methodologies, and applications but also underscores the synergistic potential of combining IGC with AI and computer vision. The informative content and insights provided will prove invaluable to researchers, scientists, and professionals in the field of advanced materials, empowering them to harness the capabilities of IGC and AI for innovative materials exploration and development.",
    "label": 1,
    "type": 5,
    "name": "bla-015"
}