{
    "text": "Purpose: The primary aim of this study was to assess the effectiveness of recommender systems in facilitating knowledge discovery. Methodology: A desktop research methodology was employed, which involved gathering secondary data from existing resources without the need for fieldwork. This approach is considered cost-effective compared to field research, as it primarily involves the expenditure of executive time, telephone charges, and directories. The study relied on published studies, reports, and statistics accessed through online journals and libraries. Findings: The findings indicated a gap in both context and methodology regarding recommender systems in knowledge discovery. It was revealed that recommender systems play a crucial role in assisting users in exploring extensive information repositories, aiding them in discovering relevant resources and expanding their knowledge. Systems utilizing advanced algorithms and personalized techniques were found to be more effective in providing tailored recommendations to users. Moreover, the study highlighted a positive relationship between user engagement metrics and knowledge discovery outcomes, emphasizing the importance of encouraging active user involvement in the recommendation process. Contextual information emerged as a critical factor influencing recommendation effectiveness. Overall, the study emphasized the continual refinement and optimization of recommender system algorithms to enhance knowledge discovery outcomes. Unique Contribution to Theory, Practice, and Policy: The study suggested anchoring future research on recommender systems in knowledge discovery using Social Learning theory, Information Foraging theory, and Cognitive Load theory. It provided recommendations to improve system efficacy, advocating for hybrid recommender systems that combine collaborative and content-based filtering techniques for more accurate and diverse recommendations. Additionally, integrating contextual information into recommendation algorithms to adapt recommendations based on situational context was proposed. The study also recommended utilizing explainable AI techniques to enhance transparency and user comprehension of recommendation processes. Maximizing user engagement through active participation and feedback, along with prioritizing recommendation diversity to encourage exploration and serendipitous discovery of new knowledge resources, was underscored as essential.",
    "label": 1,
    "type": 5,
    "name": "bla-087"
}