{
    "text": "Method: A narrative synthesis and a systematic literature review will be conducted in this review article. Literature and information will be sourced from various books and research articles on EBSCO, Google Scholar, Scopus, Web of Science, and ScienceDirect. The inclusion criteria will include studies that clearly define artificial intelligence in the education sector, are to be published and written in English, and are to be peer-reviewed. Five independent reviewers will assess search results, extract data, and will set the studies’ quality to summarize and report the findings. Result: Artificial intelligence is entering the education sector. The implementation of artificial intelligence is becoming a strategic and critical factor in educational development. Moreover, artificial intelligence is to be increasingly used as a digital assistant. They will assist teachers and students in various ways, including providing students access to a wide range of learning materials based on their specific learning needs and subjects. However, some risks are to be associated with advancements in artificial intelligence, such as safety, security, and privacy concerns. As a result, artificial intelligence technologies will have both positive and negative effects on the education sector. Conclusion: Artificial intelligence technologies will continue to have positive and negative effects on education. Thus, it will be critical to prioritize artificial intelligence in education and implement appropriate strategies to meet teachers' and students' needs and expectations through AI technologies. As a result, academic performance will be excellent. Recommendation & Implication: Qualitative research, such as interviews, or quantitative analysis, such as online questionnaires, may be developed in the future to provide more explanations and explicit findings. The implications could be applied to school administrators, teachers, and students to better understand and implement appropriate strategies to improve educational performance through AI.",
    "label": 1,
    "type": 2,
    "name": "fid-004"
}