{
    "text": "Inverse gas chromatography (IGC) has emerged as an exceedingly sensitive, versatile, and efficient technology for material analysis. By employing thermochemical methods, IGC offers vital insights into the physicochemical characteristics of materials, including dispersive surface free energy, Gibbs surface energy components, and Guttamann Lewis acid-base parameters. This comprehensive review explores the historical context, instrumentation, and diverse applications of IGC. Valuable information on the selection and description of numerous models utilized in IGC experiments is provided for researchers and practitioners. IGC finds applications across various domains, such as polymers, pharmaceuticals, minerals, surfactants, and nanomaterials. Additionally, IGC facilitates the measurement of significant parameters like sorption enthalpy and entropy, surface energy components (dispersive and specific), co/adhesion work, glass transition temperature, surface heterogeneity, miscibility, solubility parameters, and specific surface area. These insights enhance our understanding of material behavior and assist in the design and optimization of advanced materials. Furthermore, the integration of computer vision and image processing techniques with IGC has augmented our comprehension of materials' intricate surface texture, roughness, and related properties. The convergence of IGC with computer vision and artificial intelligence (AI) offers promising opportunities for future exploration of chemical materials, opening new avenues for research and discovery. This paper not only offers a comprehensive overview of IGC, its techniques, and applications but also underscores the synergistic potential of integrating IGC with AI and computer vision. The informative content and insights presented here will be beneficial to researchers, scientists, and professionals in the realm of advanced materials, empowering them to harness IGC and AI for innovative materials discovery and development.",
    "label": 1,
    "type": 0,
    "name": "fid-015"
}