{
    "text": "Educational video games offer an immersive learning experience for agricultural education by simulating real-world challenges. However, there is limited empirical evidence regarding their efficacy. This scoping review adheres to PRISMA-ScR guidelines to synthesize existing literature on educational video games for agricultural learning, identifying research patterns and gaps in the field. We systematically searched nine leading research databases for articles on educational video games for agricultural learning published from January 2000 to July 2022. Screening, data extraction, and data synthesis were performed by two independent reviewers using a narrative approach. The initial search yielded 3,297 articles, of which only 0.58% (n = 19) met the inclusion criteria. Most of the reviewed games were developed within the past five years, with a strong presence on mobile platforms. These games typically adopt a simulation-based approach, featuring 2-D graphics and tailored for single-player use. They primarily target students and cover topics such as crop production and sustainable agriculture. Educational theories were frequently unspecified in the studies. Evaluation methods mainly comprised pilot studies, focusing on user experience and knowledge acquisition. Positive outcomes, including enhanced user experiences, knowledge acquisition, and changes in attitudes and behaviors, were commonly reported. This review underscores the progress made in employing educational video games for agricultural learning over the past two decades. However, it underscores the necessity for deeper exploration into the impact of game elements on user experience and effectiveness. Developing games for underrepresented demographics and specific agricultural challenges is crucial, as is strengthening theoretical frameworks and instructional approaches. Robust research designs are essential for assessing game effectiveness over short, medium, and long durations.",
    "label": 1,
    "type": 4,
    "name": "fid-098"
}