{
    "text": "This paper proposes a novel approach to enhancing personalized recommendations in artificial intelligence recommendation systems by addressing the challenges of inter-domain information fusion and data sparsity in collaborative filtering algorithms. The study initiates by collecting Douban movie rating data along with social network information. To ensure data integrity, Levenshtein distance detection is employed to eliminate duplicate scores, while leveraging natural language processing technology to extract keywords and topic information from social texts. Additionally, graph convolutional networks are utilized to convert user relationships into feature vectors, and a distinctive thermal coding method is employed to transform discrete user and movie information into binary matrices. Introducing the Ridge regularization method to prevent overfitting, the potential feature vectors are gradually optimized. Techniques such as weighted average and feature connection are then applied to integrate features from various fields, coupling item-based collaborative filtering with merged user characteristics to curate personalized recommendation lists. In the experimental phase, the paper conducts cross-domain information fusion optimization on four mainstream mathematical matrix decomposition algorithms: alternating least squares method, non-negative matrix decomposition, singular value decomposition, and latent factor model (LFM), comparing these algorithms with the non-fused approach. The findings indicate a noteworthy enhancement in score accuracy, with mean absolute error and root mean squared error reduced by 12.8% and 13.2% respectively across the four algorithms. Additionally, at k = 10, the average F1 score reaches 0.97, and the ranking accuracy coverage of the LFM algorithm sees a surge of 54.2%. Overall, the integration of mathematical matrix decomposition algorithms with cross-domain information fusion exhibits substantial advantages in accuracy, prediction performance, recommendation diversity, and ranking quality, thereby augmenting the precision and diversity of the recommendation system and surpassing conventional models.",
    "label": 1,
    "type": 0,
    "name": "fid-090"
}