{
    "text": "Objective: This article aims to investigate the integration of artificial intelligence (AI) into the education sector and explore its impact on teaching and learning in the digital era. By synthesizing existing literature, the study seeks to provide insights into the benefits and challenges associated with AI's incorporation in education.  Method: A comprehensive review of the literature was conducted using a narrative synthesis approach. Peer-reviewed articles explicitly defining AI within an educational context, published in English and subjected to peer review, were included. Five independent reviewers evaluated research quality, extracted relevant data, and analyzed search results to ensure a comprehensive overview of the field.  Results: The study reveals the significant influence of AI on education. Its implementation is identified as a pivotal and strategic element of educational advancement. The growing role of AI as a digital assistant is particularly noteworthy, facilitating personalized learning experiences for students by tailoring educational resources to individual preferences and subject-specific needs. AI technologies are also instrumental in supporting both teachers and students across various aspects of education.  Conclusions: The integration of AI in education marks a transformative phase for the industry. While AI offers substantial benefits in terms of enhanced learning experiences and increased teacher efficiency, potential drawbacks and concerns are also evident. Privacy, security, and safety issues arising from AI development underscore the need for thoughtful implementation. Thus, AI's impact on education is multifaceted, presenting both positive and negative implications. This study serves as a foundation for stakeholders in education to navigate the evolving landscape, making informed decisions that harness the potential of AI while mitigating its risks. By comprehensively assessing AI's current and future role in education, this research contributes to shaping a balanced and effective utilization of AI technologies in the pursuit of educational excellence.",
    "label": 0,
    "type": 7,
    "name": "new-004"
}