{
    "text": "The integration of artificial intelligence (AI) and big data technology has given rise to a burgeoning field known as empathy computing. This field is dedicated to predicting, identifying, simulating, and generating human empathy through innovative computing approaches. Drawing from psychological studies, empathy computing explores concepts, measurements, neural foundations, and applications of empathy to enhance human-AI interactions. This article critically reviews the current state of research on empathy computing and outlines future directions, with a focus on advancing foundational research and practical applications.Empathy computing research is broadly categorized into four themes, each serving distinct purposes and employing different methodologies. Firstly, there is a focus on analyzing and understanding empathy using computers, which includes individual empathy assessment and empathetic content classification. Secondly, research delves into simulating and expressing empathy through computing, encompassing the design of empathetic response systems and generative empathetic dialogue systems. These streams of research are independent yet complementary, driving innovation in the field. Despite being in its early stages, empathy computing has demonstrated potential for transformative applications across various domains, including mental health, education, business services, and public management. By leveraging AI and big data, empathy computing enables personalized and empathetic interactions, enhancing user experiences and fostering trust. However, concerns regarding safety and ethics necessitate a collaborative approach between humans and computers in performing empathetic tasks.Empathy computing represents a frontier in understanding and promoting empathy in the context of human-AI relationships. It extends traditional studies on empathy into new territories, raising questions about the universality of empathy and its evolution in human-computer interaction. Future research should focus on developing integrated theoretical models, establishing reliable datasets, and refining empathy computing",
    "label": 0,
    "type": 7,
    "name": "new-042"
}