{
    "text": "A new era of education and research based on chatbots and artificial intelligence is quickly growing. However, the application of these new systems is associated with several challenges and limitations, mainly related to ethics. This paper explores the potential use of AI systems and chatbots in the academic field and their impact on research and education from an ethical perspective. Through a qualitative methodology, the researcher perform exploratory research and data collection based on expert analysis and interpretation. The researcher conducted a comprehensive review of the main potential challenges associated with the use of chatbots in education and research to identify current practices, challenges, and opportunities. This explorative work provides a foundational understanding of the studied topic. It also helps us to better understand the subjective experiences and perspectives of the observed phenomenon, and uncovers their meanings and proposes potential solutions to the observed issues. This study examines the advantages and limitations of AI systems and chatbots, as well as their role in supporting human expertise and judgment. The paper also discusses the ethical challenges related to the use of AI systems and chatbots in research, as well as the potential for misuse and exploitation. It also proposes effective solutions to the observed ethical dilemmas. The research admits that we live in a new era of AI-based education and research. The observed technological advancements will definitely shift research processes and transform educative systems, especially in term of assessments. Digital assessments are going to disappear and assessment methods need to be more creative and innovative. The paper highlights the necessity of adaptation to the new reality of AI systems and chatbots. Co-living, sustainability and continuous adaptation to the development of these systems will become a matter of emergency. Raising awareness, adopting appropriate legislations and solidifying ethical values will strengthen research and protect educational systems. The presence of AI systems and chatbots in education needs to be considered as an opportunity for development rather than a threat.",
    "label": 0,
    "type": 7,
    "name": "new-008"
}